{
  "exclusive": {
    "Herrscher of Thunder": [
      {
        "name": "Herrscher of Thunder",
        "signets": [
          {
            "name": "Divine Penalty",
            "description": "In burst mode, Bombard costs 300% Herrscher Charge and every hit deals 800% ATK of bonus Lightning DMG."
          },
          {
            "name": "Tsukuyomi",
            "description": "Tap [ATK] after evasion to connect into Basic ATK Sequence 4. Basic ATK Sequence 4 boosts Total DMG by 40% for 5s. Basic ATK Sequence 5 restores 10 bonus SP."
          },
          {
            "name": "Hazy Moon",
            "description": "Basic ATK Sequence 5 unleashes 3 bolts of thundering sanction each dealing 1200% ATK of Lightning DMG on hit."
          },
          {
            "name": "Mitama",
            "description": "Max Herrscher Charge doubles and entering burst mode fully restores it. In burst mode, 75 Herrscher Charge is restored per second. Basic ATK Sequence 5 restores 300 bonus Herrscher Charge."
          },
          {
            "name": "Narukami",
            "description": "Finisher unleashes 8 bolts of Thundering Sanction, each dealing 900% ATK of Lightning DMG on hit. Every 20 combo hits grant an additional bolt. 12 bolts max."
          }
        ]
      }
    ],
    "Herrscher of Reason": [
      {
        "name": "Herrscher of Reason",
        "signets": [
          {
            "name": "Creation",
            "description": "In non-bike mode, Charged ATKs create 6 hover guns to attack, each dealing 160% ATK of Ice DMG on hit."
          },
          {
            "name": "Truth",
            "description": "Triggering Ultimate Evasion Skill fully restores Konstruktyom. When Konstruktyom is below 120, any evasion can trigger Ultimate Evasion Skill and additionally restore 10 SP."
          },
          {
            "name": "Reason",
            "description": "Every hit from hover guns reduces weapon active CD by 0.7s and boosts Total DMG dealt by the weapon active by 3% for 5s. 24 stacks max."
          },
          {
            "name": "Wisdom",
            "description": "In bike mode, Charged ATK inflicts a Structural Impact on enemies hit and deals 3000% ATK of Ice DMG."
          },
          {
            "name": "Inspiration",
            "description": "Triggering an Ultimate Evasion by any means inflicts a Structural Impact on enemies hit and deals 5000% ATK of Ice DMG."
          }
        ]
      }
    ],
    "Herrscher of Flamescion": [
      {
        "name": "Herrscher of Flamescion",
        "signets": [
          {
            "name": "Reburn",
            "description": "Triggering Ultimate Evasion Skill removes Overheat and clears Heat. Ultimate Evasion Skill has one more charge."
          },
          {
            "name": "Tempered Warrior",
            "description": "Aerial Combo ATKs reduce Ultimate Evasion Skill CD by 9s. Total DMG taken in midair is reduced by 30%."
          },
          {
            "name": "Flamescion",
            "description": "For every black hole created by the Herrscher of Flamescion, Valkyrie restores 25 HP per second and deals 30% bonus Total DMG. Barrier HP increases by 25%."
          },
          {
            "name": "Starfire",
            "description": "When the black hole created by the Herrscher of Flamescion ends, a smaller black hole lasting 5s is generated to deal 400% ATK of Fire DMG per second. CD: 3s."
          },
          {
            "name": "Heatflow",
            "description": "The black hole generated by the Herrscher of Flamescion deals 100% bonus Fire DMG. Triggering Ultimate Evasion Skill creates an additional black hole."
          }
        ]
      }
    ],
    "Stygian Nymph": [
      {
        "name": "Stygian Nymph",
        "signets": [
          {
            "name": "Kindred",
            "description": "Any mark resonance triggers the effect twice and deals 10% bonus Physical DMG. CD: 5s."
          },
          {
            "name": "Vulnerable Duality",
            "description": "Triggering Ultimate Evasion Skill reduces Ultimate CD by 40%. At full Veilian ld or Saulian Ego, Charged ATK reduces Ultimate Evasion CD Skill by 20%."
          },
          {
            "name": "Union",
            "description": "Within 12s after switching between Saule and Veliona, Valkyrie deals 10% bonus Total DMG and resonances of either Sunnebrands or Veilmarks trigger the resonance effects of both marks."
          },
          {
            "name": "Intergrowth",
            "description": "Switching between Saule and Veliona restores full Ultimate Evasion Skill charges. When evading through an enemy and triggering Ultimate Evasion Skill, the enemy takes 10% bonus Total DMG for 6s."
          },
          {
            "name": "Might of Duality",
            "description": "Casting Ultimate creates a resonance field (up to 3 can be present). Resonances of Sunnebrands or Veilmarks deal 200% ATK of bonus Physical DMG to enemies within the field."
          }
        ]
      }
    ],
    "Argent Knight: Artemis": [
      {
        "name": "Argent Knight: Artemis",
        "signets": [
          {
            "name": "Winter Harvest",
            "description": "Enemies recovering from Ice Cell are inflicted with 1 stack of Hypothermia."
          },
          {
            "name": "Cold Moon",
            "description": "Inflicting Ice Cell also creates a self-centered Frost Ring lasting 6s which deals 180% ATK of Ice DMG per 0.3s to enemies nearby."
          },
          {
            "name": "Frost Scythe",
            "description": "Tap [ATK] after evasion to hurl Frost Guisarmier which spins for 5s, gathers enemies nearby, and deal 5400% ATK of Ice DMG. CD: 8s."
          },
          {
            "name": "Uranian Mirror",
            "description": "Burst mode costs double SP to maintain. In burst mode, Valkyrie deals 90% bonus Total DMG and every 10 SP consumed further boosts Total DMG by 3% until burst mode ends."
          },
          {
            "name": "Stellar Trials",
            "description": "Inflicting Ice Cell also creates a Frost Ring centered around the target lasting 2s which deals 540% ATK of Ice DMG per 0.3s to enemies nearby."
          }
        ]
      }
    ],
    "Ritual lmayoh": [
      {
        "name": "Ritual lmayoh",
        "signets": [
          {
            "name": "Torch",
            "description": "When a Combo ATK with KE consumed hits, all gun turrets fire a laser beam at the target to deal Combo ATK stacks × 2200% ATK of Physical DMG."
          },
          {
            "name": "Dawn",
            "description": "At full KE, the next Combo ATK consumes all of it to constitute 4 stacks and additionally fire 4 homing missiles dealing 3600% ATK of Physical DMG (double against shields)."
          },
          {
            "name": "Blossom",
            "description": "Homing missiles restore 3 SP on hit. Basic ATK Sequence 6 additionally fires 4 homing missiles each dealing 200% ATK of Physical DMG."
          },
          {
            "name": "Prosperity",
            "description": "Tap [ATK] after evasion to dash to enemies for an aerial kick, which can be connected into Basic ATK Sequence 4. Basic ATK Sequence 6 restores 200 KE on every hit."
          },
          {
            "name": "Fertility",
            "description": "Ultimate replenishes 40 light bullets for every gun turret, boosts their Tech Level by 1 (caps at 3), and increases their firing speed. Each turret restores Tech Level  50 KE per second."
          }
        ]
      }
    ],
    "Valkyrie Gloria": [
      {
        "name": "Valkyrie Gloria",
        "signets": [
          {
            "name": "Impetus",
            "description": "Entering Sprint triggers Stage 2 and until Sprint ends, attacks additionally cost 40 Resolve on hit to deal 2700% ATK of Fire DMG per second."
          },
          {
            "name": "Gloria",
            "description": "The last hit of Charged ATK or Throw ATK inflicts Magnifica Mark on enemies which explodes after a short delay to deal 2000% ATK of Fire DMG."
          },
          {
            "name": "Sol",
            "description": "Within 3s after casting Ultimate Evasion Skill, Basic ATK Sequence 5 or the last hit of Charged ATK inflicts Magnifica Mark on enemies which explodes after a short delay to deal 1600% ATK of Fire DMG."
          },
          {
            "name": "Battle Song",
            "description": "Weapon actives and Counter Throws deal 270% bonus Total DMG. Hitting an enemy with Charged ATK in Aura Ignis resets weapon active CD."
          },
          {
            "name": "Triumph",
            "description": "Triggering Ultimate Evasion Skill or detonating Magnifica Mark restores 15 SP and boosts Fire DMG by 15% for 8s."
          }
        ]
      }
    ],
    "Prinzessin der Verurteilung!": [
      {
        "name": "Prinzessin der Verurteilung!",
        "signets": [
          {
            "name": "Dark Wings",
            "description": "When Ultimate Evasion Skill is triggered, Oz unleashes dark lightning to deal 5600% ATK of Lightning DMG."
          },
          {
            "name": "Retribution",
            "description": "Grants 1 stack of Retribution every 7s. 2 stacks max. QTE consumes 1 stack to create a small lightning field"
          },
          {
            "name": "Nightfall",
            "description": "Weapon actives deal 300% bonus Total DMG. Summoning Oz with Charged ATK or casting Ultimate refills 2 weapon active charges."
          },
          {
            "name": "Fate",
            "description": "When hitting an enemy weakspot with a weapon active, Oz unleashes dark lightning to deal 2000% ATK of Lightning DMG and reduces weapon active CD by 50%."
          },
          {
            "name": "Midnight",
            "description": "During Ultimate, Oz lingers on for Is after the arrow rain. Every 5 hits from Oz on enemies within the Ultimate range summons dark lightning to deal 1500% ATK of Lightning DMG. Every hit of Ultimate deals 125% ATK of Lightning DMG."
          }
        ]
      }
    ],
    "Miss Pink Elf♪": [
      {
        "name": "Miss Pink Elf♪",
        "signets": [
          {
            "name": "Zenith",
            "description": "While Ultimate is active, each ricochet deals 20% ATK of bonus Physical DMG on hit. Every wave of ricochet reduces weapon active's CD by 0.6s."
          },
          {
            "name": "Purity",
            "description": "Ultimate lasts 20s longer. While Ultimate is active, a wave of ricochet occurs under Flawless Dome every second. The ricochets triggered in this way only ricochet 3 times but deal 130% ATK of Physical DMG. (DMG Source: Ultimate)"
          },
          {
            "name": "Love",
            "description": "Each Charged Shot: Cupid's Bolt restores 2 SP. While Ultimate is active, Charged Shot: Cupid's Bolt consumes 100% bonus Infatuation and deals 700% ATK of bonus Physical DMG."
          },
          {
            "name": "Beauty",
            "description": "Using weapon active restores 1 additional Ultimate Evasion charge. Enemies take 35% bonus Total DMG when a Crystalline Seed is attached to them."
          },
          {
            "name": "Benevolence",
            "description": "Ultimate Evasion Skill has 1 more charge. Infatuation is fully restored when Ultimate Evasion Skill is triggered. If Infatuation drops below 100 after using Charged Shot: Cupid's Bolt, you can consume 1 Ultimate Evasion charge to trigger Ultimate Evasion Skill."
          }
        ]
      }
    ],
    "Bright Knight: Excelsis": [
      {
        "name": "Bright Knight: Excelsis",
        "signets": [
          {
            "name": "Paragon",
            "description": "Casting Weapon Active shortens Ultimate CD by 5s. Ultimate grants 5 stacks of Paragon, each of which boosts Total DMG by 4% for 15s."
          },
          {
            "name": "Gambit",
            "description": "Triggering Retaliation or Ultimate Evasion boosts Physical DMG by 40% for 8s. If triggered outside Burst mode, Valkyrie gains Iron Body for 8s; if triggered in Burst mode, Valkyrie additionally unleashes a counterattack cross strike before Phantom Cleave to deal 1200% ATK of Physical DMG."
          },
          {
            "name": "Holy Lance",
            "description": "During Basic ATK SEQ 4, tap [ATK] repeatedly to thrust the lance at enemies in an increasingly violent manner to deal a total of 6000% ATK of Physical DMG, and Valkyrie is immune to frontal and flank attacks. When Valkyrie's SEQ 4 attack reaches its peak, Basic ATK SEQ 5 will be enhanced to deal 4500% ATK of bonus Physical DMG to enemies in a large area."
          },
          {
            "name": "Formation",
            "description": "Basic ATK SEQ 5 creates a 3-sec Grav Singularity that pulls in surrounding enemies and deals 2100% ATK of Physical DMG to them. Basic ATK SEQ 4 & 5 and the explosion of the Grav Singularity boost Valkyrie's Total DMG by 3% for 40s (20 stacks max)."
          },
          {
            "name": "Glory",
            "description": "In Burst mode, Weapon Active has 70% shorter CD and can deal 2400% ATK of bonus Physical DMG at the cost of 8 SP. Weapon Active gains 4% Total DMG boost per second, and the boost resets when Burst mode is activated again."
          }
        ]
      }
    ],
    "Luna Kindred": [
      {
        "name": "Luna Kindred",
        "signets": [
          {
            "name": "Imprint",
            "description": "Each Charged ATK that consumes Sanguine Mark will enable the next Charged ATK that consumes Sanguine Mark to deal bonus Physical DMG equal to 0.5x the amount of current HP loss."
          },
          {
            "name": "Immortality",
            "description": "Triggered once at below 1% HP to deal Physical DMG equal to 1.5x the amount of current HP loss to surrounding enemies every 0.8s for 6s, during which Valkyrie will not die and restores 5% HP afterward. This effect's triggering chance will be reset after Valkyrie HP rises back to 33%."
          },
          {
            "name": "Thirst",
            "description": "Lower HP enables higher HP recovery (max boost: 300%). If Valkyrie restores more than 10% HP within a short period of time, all enemies will be impaired for 10s (DEF -40%)."
          },
          {
            "name": "Blood Feast",
            "description": "Within the next 12s after Ultimate's final hit lands, each Charged ATK deals bonus Physical DMG equal to 1.5x the amount of current HP loss."
          },
          {
            "name": "Penumbra",
            "description": "Each Charged ATK only deals 160% ATK of Physical DMG, but every 4 consecutive Charged ATKs boost the speed of wielding the giant ax. Valkyrie gains a barrier with HP equal to 100% of her Max HP; when Sanguine Mark is below 50, every 3% Valkyrie HP will be converted to 1% barrier HP instead of Sanguine Mark cost."
          }
        ]
      }
    ],
    "Valkyrie Bladestrike": [
      {
        "name": "Valkyrie Bladestrike",
        "signets": [
          {
            "name": "Karma",
            "description": "Gotamashi Edge deals 15% ATK of bonus Physical DMG. When casting Gotamashi Edge, each EM Reserve point consumed provides 2 bonus blades that can cut through enemies."
          },
          {
            "name": "Current",
            "description": "Gotamashi Edge deals 60% ATK of bonus Physical DMG. Casting Gotamashi Edge consumes all EM Reserves to generate additional penetrating Gotamashi Edges."
          },
          {
            "name": "Zanshin",
            "description": "Increases the Physical DMG dealt by Combo ATK: Blade Flurry by 60%. For every 4 EM Reserves restored, gains a barrier with of her max HP that lasts 3s. Triggering it again resets the barriers HP."
          },
          {
            "name": "Thunder",
            "description": "For every 4 EM Reserves restored, releases a burst of lightning that deals 1200% ATK of Physical DMG to surrounding enemies."
          },
          {
            "name": "Idea",
            "description": "Can use Ultimate after entering Burst mode for 4s. After using Ultimate again in Burst mode, her Total DMG will be increased by 40% until Burst mode ends."
          }
        ]
      }
    ],
    "Starchasm Nyx": [
      {
        "name": "Starchasm Nyx",
        "signets": [
          {
            "name": "Frigidity",
            "description": "In burst mode, every 4 Charged ATKs trigger a frost explosion to deal 1300% bonus Ice DMG. Within the first 8s of burst mode, it only takes 2 Charged ATKs to trigger the explosion."
          },
          {
            "name": "Nightmare",
            "description": "In burst mode, every Carmine Gash consumed boosts Total DMG of Ultimate Sequence 2 by 35%. 10 stacks max."
          },
          {
            "name": "Abyssal Gaze",
            "description": "Ultimate has 60% reduced CD. Nightmare Thorns pass-on DMG increases by 24%."
          },
          {
            "name": "Cocoon Break",
            "description": "In normal mode, consuming 6 Carmine Gashes boosts Ice DMG of Charged ATK by 600% and restores 40 bonus SP. In burst mode, consuming 6 Carmine Gashes restores 40 bonus SP."
          },
          {
            "name": "Toxic Bath",
            "description": "Weapon skill CD is reduced by 50%. Enemies hit by chain claws take 45% bonus Total DMG for 8s."
          }
        ]
      }
    ],
    "Infinite Ouroboros": [
      {
        "name": "Infinite Ouroboros",
        "signets": [
          {
            "name": "Dark Assault",
            "description": "Basic/Charged/Combo ATKs deal 50% bonus Lightning DMG. Linked enemies hit by Basic/Charged/Combo ATKs pass on 15% of the DMG to other linked enemies."
          },
          {
            "name": "Mirage",
            "description": "In submerged mode, enemies in range take 250% ATK of Lightning DMG per 0.25s and take 40% bonus Total DMG for 8s."
          },
          {
            "name": "Ravenousness",
            "description": "Exiting submerged mode deals 2000% ATK of AOE Lightning DMG and enemies hit take 35% bonus Combo ATK DMG in the next 8s (independent effect)."
          },
          {
            "name": "Ill Fortune",
            "description": "Ultimate deals 300% bonus Lightning DMG. Every Genesis Seed consumed reduces Ultimate CD by 1s."
          },
          {
            "name": "Ascension",
            "description": "When Umbra of Ouroboros is active, enemies are struck by lightning once per second and take 800% ATK of Lightning DMG (DMG source: Basic ATK)."
          }
        ]
      }
    ],
    "Midnight Absinthe": [
      {
        "name": "Midnight Absinthe",
        "signets": [
          {
            "name": "Suppression",
            "description": "Feather Arrows, Feather Blades, Feathers, and Night Roamer stacks cap at 30. Night Roamer boosts Fire DMG by 20%."
          },
          {
            "name": "Wild Hunt",
            "description": "The follow-up of Basic ATK Sequence 5 is no longer limited by Night Roamer stacks. Basic ATK Sequence 5 and every hit of the follow-up consume 10 Night Roamer stacks to shoot 5 more arrows, each dealing 180% ATK of Fire DMG."
          },
          {
            "name": "Arrowhead",
            "description": "Weapon actives restore 30 bonus SP and reduce Ultimate CD by 10s. Can only be triggered once per 8s."
          },
          {
            "name": "Raven Plume",
            "description": "Ultimate Evasion Skill reduces the ATK of enemies nearby by 75% and makes Valkyrie's attacks deal 35% ATK of bonus Fire DMG for 12s. Ultimate Evasion Skill has one extra charge."
          },
          {
            "name": "Ominous Mist",
            "description": "Raven Cloud has a large range and deals 7500% DMG when it explodes. Raven Cloud vaporizes after the explosion."
          }
        ]
      }
    ],
    "Violet Executer": [
      {
        "name": "Violet Executer",
        "signets": [
          {
            "name": "Penalty",
            "description": "In Fervent state, Total DMG and DMG Reduction increase by 15% and 3% per second respectively for up to 10 stacks. Reset when exiting Fervent state."
          },
          {
            "name": "Sanction",
            "description": "Every 150 combo hits trigger slashing blades to deal 2x1000% ATK of Physical DMG and grant 40% Physical Breach lasting 1s. CD: 5s."
          },
          {
            "name": "Radiance",
            "description": "Ultimate Evasion Skill resets Fervor drain speed, boosts Physical DMG by 100% for 8s. Casting Feverish Barrage in Fervent state triggers Ultimate Evasion Skill but not Fang Execution."
          },
          {
            "name": "Banishment",
            "description": "Every 50 combo hits reduce Ultimate CD by 18% and restore 5 SP. CD: 2s. Ultimate deal 150% bonus Physical DMG and an additional 3000% ATK of Physical DMG. Blood Tide continuously gathers enemies nearby."
          },
          {
            "name": "Dusk",
            "description": "With Polarization Agent consumed, Feverish Barrage deals 3000% ATK of bonus Physical DMG and grants 10% bonus Move Speed for 20s. 6 stacks max."
          }
        ]
      }
    ],
    "Herrscher of Sentience": [
      {
        "name": "Herrscher of Sentience",
        "signets": [
          {
            "name": "Dark Plumes",
            "description": "Combo ATK restores 1 SP and unleashes a plume attack on hit to deal 150% ATK of Physical DMG and make enemies hit take 30% bonus Total DMG for 5s. CD: 0.5s."
          },
          {
            "name": "Legion",
            "description": "Sword, spear, and chain blades Combo ATKs restore 300 sword, spear, and chain blades energy respectively and boost Total DMG by 80% for 8s."
          },
          {
            "name": "Supremacy",
            "description": "Shield: I'm Untouchable absorbs 100% of DMG taken and deals 5000% ATK of Physical DMG to enemies within 8 meters when it ends or resets. The shield's minimum CD is reduced to 8s."
          },
          {
            "name": "Victory",
            "description": "In Herrscher Form, Combo ATK: Slashes can have up to 18 slashes. After reaching 7 slashes, every slash deals 750% ATK of bonus Physical DMG."
          },
          {
            "name": "Ego",
            "description": "Casting Combo ATK summons an illusion (summoned entity) to replicate the attack. In Herrscher Form, the illusion only replicates the slashes each dealing 105% ATK of Physical DMG. The illusion has 500% of the Valkyrie's ATK."
          }
        ]
      }
    ],
    "Sweet 'n' Spicy": [
      {
        "name": "Sweet 'n' Spicy",
        "signets": [
          {
            "name": "Brake",
            "description": "Charging speed accelerates and Physical DMG of Charged ATK increases by 20%. My Hands Are Burning stacks faster."
          },
          {
            "name": "Impulse",
            "description": "Armor Shredder maxes at 6 stacks and stacks twice each time."
          },
          {
            "name": "Rupture",
            "description": "Ground Charged ATK can charge up to 4 stages and deal 500% ATK of bonus Physical DMG."
          },
          {
            "name": "Revolution",
            "description": "Each charging stage reduces Ultimate CD by 1s. Ultimate and aerial Charged ATK deal 20% bonus Physical DMG to enemies not protected by shields."
          },
          {
            "name": "Skyfall",
            "description": "Each stage of aerial charging stacks Momentum once up to 6 stacks. Each stack boosts Ultimate DMG by 15% and restores 200 HP. Removed upon Ultimate cast."
          }
        ]
      }
    ],
    "Silverwing: N-EX": [
      {
        "name": "Silverwing: N-EX",
        "signets": [
          {
            "name": "Silver Eagle",
            "description": "The last sequence of Basic ATKs restores 2.5 SP and deals 200% of ATK as bonus Ice DMG. With scatter barrier present, Valkyrie deals 40% bonus Ice DMG and the last sequence of Basic ATKs reduces charging CD by 5s."
          },
          {
            "name": "Grey Falcon",
            "description": "Restores 2.5 SP per second. Scatter barrier enables Combo ATK and each cast grants 1 stack of Repeating Sequence which costs 7 SP and make Combo ATK deal 24% ATK of bonus Ice DMG. 4 stacks max. Stacks are reset when scatter barrier is removed or created."
          },
          {
            "name": "Pale Feathers",
            "description": "Attacks restore 75% bonus SP. Ultimate deals 3500% ATK of bonus Ice DMG. On hit, Ultimate boosts Elemental Breach by 10% and Total DMG by 65% for 10s. Triggering it again resets the duration."
          },
          {
            "name": "Phantom Plumes",
            "description": "After using support skills, tapping [ATK] triggers QTE. QTE boosts Ice DMG by 30% for 30s. 2 stacks max. Triggering it again resets the duration. Support skills have 10% reduced CDs."
          },
          {
            "name": "Sharp Eyes",
            "description": "For 10s after landing the Ultimate, Basic ATKs deal 45% of ATK as bonus Ice DMG and Valkyrie restores 30 HP plus 4 SP per second. Triggering it again resets the duration."
          }
        ]
      }
    ],
    "Dea Anchora": [
      {
        "name": "Dea Anchora",
        "signets": [
          {
            "name": "Brilliance",
            "description": "Voidstar Anchor and Astral Flares EX cost no SP and restore 3 SP. Every 30 SP restored deals 1200% ATK of Fire DMG to enemies within 10 meters. CD: 6s."
          },
          {
            "name": "Halo",
            "description": "Voidstar Anchor, Voidstar Anchor EX, Astral Flares, and Astral Flares EX deal 2800% ATK of Fire DMG to enemies within 8 meters of the target hit, gather them, and restore 50 Astrum. CD: 10s."
          },
          {
            "name": "Sheen",
            "description": "Voidstar Anchor EX and Astral Flares EX do not suspend Astrum cosumption, but Seirios Ballista doesn't end Astral Harness and clear Astrum. Seirios Ballista costs 65 SP at most and every SP cost deals 70% ATK of Fire DMG."
          },
          {
            "name": "Gale",
            "description": "In Astral Harness, all attacks ignite enemies hit and ignited enemies take 25% bonus Total DMG for 10s. If hitting ignited enemies, Seirios Ballista returns extra SP cost (20 max)."
          },
          {
            "name": "Stars",
            "description": "Ultimate deals 50% bonus Total DMG. Voidstar Anchor, Voidstar Anchor EX, Astral Flares, and Astral Flares EX boost Valkyrie's Fire DMG by 20% for 5s. Can be refreshed."
          }
        ]
      }
    ],
    "Palatinus Equinox": [
      {
        "name": "Palatinus Equinox",
        "signets": [
          {
            "name": "Gallop",
            "description": "The physical DMG of Valkyrie is increased by 40%, and the physical DMG of Elite Thrust is increased by 0.8% for every 1% of HP lost. The physical DMG of Sprint is increased by 0.3%. Each hit reduces HP by 5% and grants 1 SP. Consumes Knight Guardian to restore all ICHOR."
          },
          {
            "name": "Abyssal Chant",
            "description": "The physical DMG of Valkyrie is increased by 60%, the total DMG dealt by the Ultimate is increased by 200%, and the Ultimate Evasion Skill is refreshed twice after the Ultimate is cast."
          },
          {
            "name": "Exodus",
            "description": "Valkyrie's total DMG is increased by 30%, and the last hit of Equinox Severance will shatter the ground and consume Knight Guardian, dealing 1800% of ATK as physical DMG to all enemies and impairing them for 15s, reducing the enemies' DEF by 50%."
          },
          {
            "name": "Commitment",
            "description": "Valkyrie's physical DMG is increased by 50%, and the total DMG of weapon skills increases by 70%. The first two hits of Equinox Severance restore 3 SP per hit and reduce Ultimate CD by 1s. CD: 20s."
          },
          {
            "name": "Equinox",
            "description": "Valkyrie's total DMG is increased by 50%. Palatinus Equinox is enhanced when switching forms and unleashing the Ultimate. Valkyrie deals 50% more physical DMG for 15s, repeatedly triggering refreshes the duration."
          }
        ]
      }
    ],
    "Spina Astera": [
      {
        "name": "Spina Astera",
        "signets": [
          {
            "name": "Wild Flare",
            "description": "Each hit of Astral Flare unleashes Astral Flare: Erupt, casting 1 Astral Rend in front that deals 200% of ATK as Fire DMG. Each launch of Astral Rend exits Astral Harness state, restoring 3 SP and 80 Astrum, with a maximum of 8 casts."
          },
          {
            "name": "Star Quillon",
            "description": "When unleashing Astral Flare: Ignite, and Astral Flare: Combust, the 4th hit of Basic ATK in Astral Harness state deals 500% of ATK as Fire DMG to enemies within 10m, pulls them towards Valkyrie, and increases the total DMG taken by the target by 30%."
          },
          {
            "name": "Alrescha",
            "description": "[Astral Flare] hits one more time. When Astral Flare hits the target, its Fire DMG increases by 60% for 5s. This effect can be refreshed."
          },
          {
            "name": "Radiant Formation",
            "description": "[Astral Flare: Erupt] hits one more time. After unleashing Astral Flare: Erupt, the remaining Ultimate CD reduces by 20% and 300 Astrum is restored."
          },
          {
            "name": "Holy Flame",
            "description": "Astral Flare deals an additional 500% ATK of Fire DMG to the target for every 6 hits and increases the Fire DMG to the hit target by 30% (independent effect) for 5s. Can be refreshed."
          }
        ]
      }
    ],
    "Fallen Rosemary": [
      {
        "name": "Fallen Rosemary",
        "signets": [
          {
            "name": "God Eater",
            "description": "When God Eater hits, a lightning bolt strikes, dealing 5x170% ATK of Lightning DMG to enemies nearby, and fully recharges Strix."
          },
          {
            "name": "Soul Siphon",
            "description": "In Valfreyja form, Basic ATK siphons extra 50 Disir. It has 2 charges, which reset upon casting God Eater. Ormr Rune deals extra 120% ATK of Lightning DMG. Ulf Rune increases Lightning DMG by 70%."
          },
          {
            "name": "Valfreyja",
            "description": "In Valfreyja form, Lightning DMG is increased by 60%. After casting Helvegr, Trickster's attack will pull enemies again; After 3s, it will release a blast that deals 2600% ATK of Lightning DMG to nearby enemies, and reconjure Ulf/Ormr/Strix Rune."
          },
          {
            "name": "Nocturne",
            "description": "Using God Eater increases Charged ATK's Total DMG by 120%, reduces Ultimate's CD by 5s, and increases Ultimate's Total DMG by 110% for 10s. Triggering it again resets its duration."
          },
          {
            "name": "Spirit Servants",
            "description": "Using God Eater increases Charged ATK's Total DMG by 120%, reduces Ultimate's CD by 5s, and increases Ultimate's Total DMG by 110% for 10s. Triggering it again resets its duration."
          }
        ]
      }
    ],
    "Reverist Calico": [
      {
        "name": "Reverist Calico",
        "signets": [
          {
            "name": "Hidden Claws",
            "description": "When Combo ATK/Paw Barrage/Predation hits, the target drops 10 Shiny Silvers. It has 5 charges, which reset every floor (unaffected by other effects). It also increases Ice DMG by 60% for 10s. Triggering it again resets the duration."
          },
          {
            "name": "the Tailpiece",
            "description": "Combo ATK deals 1000% more Total DMG. When Combo ATK hits, reduces Megaton Furball's CD bt 4s (CD: 3s)."
          },
          {
            "name": "Nighteye",
            "description": "Paw Barrage/Predation deals 125% more Total DMG. Using Combo ATK reduces Paw Barrage's CD by 3s."
          },
          {
            "name": "Cat's Eye",
            "description": "In Runaway state, using Combo ATK/Paw Barrage/Predation increases Total DMG by 25%. It stacks 5 times, and the 5th stack triggers a blast that deals 1500% ATK of Ice DMG within a 12m radius of the caster. Triggering the blast or exiting Runaway state removes all stacks."
          },
          {
            "name": "Phantasma",
            "description": "Metaton Furball deals 240% more Ice DMG. Runaway state lasts 5s longer."
          }
        ]
      }
    ],
    "Golden Diva": [
      {
        "name": "Golden Diva",
        "signets": [
          {
            "name": "Arioso",
            "description": "During Sound of Nature, each note consumed increases Total DMG by 12% with a max stack of 10. This is reset when Sound of Nature ends."
          },
          {
            "name": "Fugue",
            "description": "Ensemble combo sequence is increased by 6. Hurling pistols Total DMG increases 140%."
          },
          {
            "name": "Concerto",
            "description": "Each Combo ATK grants 1 Charge. At 4 Charge, Basic and Combo ATKs' Total DMG increase by 60% for 15s. Charge consumed on use and cannot be restored during use. Restores 12 SP after use."
          },
          {
            "name": "Cadenza",
            "description": "Chord and Variation launch sound waves dealing 550% Lightning DMG. Each wave increases Total DMG reduction by 30% and slightly raises Ignore Interrupt for 10s while restoring 2 or 4 SP respectively. Triggering it again resets the duration."
          },
          {
            "name": "Symphony",
            "description": "Hurl pistols when using Ensemble Playing for 12SP and dealing 350% Lightning DMG."
          }
        ]
      }
    ],
    "Disciplinary Perdition": [
      {
        "name": "Disciplinary Perdition",
        "signets": [
          {
            "name": "Admonishment",
            "description": "Aponia gains 40% Total DMG Reduction. In Predictor's Sentence form, Lightning DMG increases 30% every 0.5s for a maximum of 180%. Inhibitor's Adjudication deals an additional 400% Lightning DMG."
          },
          {
            "name": "Atonement",
            "description": "Aponia illusory Summoned Entity wherever she does, dealing 385% Lightning DMG every second to surrounding enemies. The illusion's Total DMG increases 100% and restores 12 SP after leaving Predictor's Sentence form."
          },
          {
            "name": "Shelter",
            "description": "In Predictor's Sentence form, Redemption cost per second reduced by 55%; Total DMG dealt by Thunderstorm and Inhibitor's Adjudication increases 70% and count as Ultimates."
          },
          {
            "name": "Inclusiveness",
            "description": "Restores 12 SP and reduces Ultimate CD by 6s when illusion uses QTE. Increases Ultimate's Total DMG by 60%. Ultimate restores up to 100% Redemption when used."
          },
          {
            "name": "Rescue",
            "description": "Illusory Summoned Entity will deal Paralyse Trauma alongside DMG. DMG dealt by your Ultimate Evasion Skill increases 120%. Lightning DMG dealt by you or your illusion increases 70%."
          }
        ]
      }
    ],
    "Molotov Cherry": [
      {
        "name": "Molotov Cherry",
        "signets": [
          {
            "name": "Thorns",
            "description": "Physical DMG from Basic ATKs (including Charged ATKs) increase 30% and restore 1 SP on hit. At 150 SP, Ultimate cost increases 50 SP. Total DMG dealt by Ultimate increases by 30%."
          },
          {
            "name": "Fervor",
            "description": "In Fervent Mode, surrounding enemies take 25% more Physical DMG; Fervent Juice is consumed 50% faster (cannot stack)."
          },
          {
            "name": "Solitude",
            "description": "In Fervent Mode, Basic ATKs add 30% ATK of Physical DMG. The last hit of Ultimate adds 300% ATK of Physical DMG."
          },
          {
            "name": "Mixing",
            "description": "Charged ATK and Ultimate draw in enemies within a large radius and increase their Total DMG taken by 40% for 8s. Triggering it again resets the duration."
          },
          {
            "name": "Silence",
            "description": "Ultimate CD is reduced 30% and Total DMG dealt is increased 400%. Weapon Active CD is reduced 2s each time Ultimate deals DMG. Strike Back EX is usable during the entirety of Fortress Mode."
          }
        ]
      }
    ],
    "Starry Impression": [
      {
        "name": "Starry Impression",
        "signets": [
          {
            "name": "Starry Night",
            "description": "Combo ATKs deal an additional 1200% ATK of Physical DMG for every Color Marker consumed. This DMG counts as bleeding DMG. Upon consuming Red, Yellow, or Blue Color Marker, Valkyrie's Weapon Skill, Ultimate, and Ultimate Evasion Skill CDs are reduced 1s. Combo ATKs consuming all Color Markers can be connected into Basic ATK SEQ 3."
          },
          {
            "name": "River Forest",
            "description": "Valkyrie's ATK Speed increases 25% during Ultimate, and SEQ 3 and SEQ 5 of basic ATKs gain an additional Color Marker (same color as would be normally granted). DMG dealt to all enemies during Ultimate increases 20% (cannot stack)."
          },
          {
            "name": "Feathers",
            "description": "Total DMG delt to enemies infliced with Bleed increases 10% for every stack infliced. Combo ATKs grant buffs upon consuming all Color Markers and deal 1000% ATK of Bleed DMG on hit. CD: 0.5s"
          },
          {
            "name": "Azure Wind",
            "description": "Triggering Ultimate Evasion Skill grants 3 Color Markers and boosts Total DMG taken by all eneimes by 40% for 20s."
          },
          {
            "name": "Cloud Valley",
            "description": "Physical DMG increases 40% and SEQ 4 of basic ATKs draw in surrounding enemies within a wide radius."
          }
        ]
      }
    ],
    "Helical Contraption": [
      {
        "name": "Helical Contraption",
        "signets": [
          {
            "name": "Assemblage",
            "description": "Once Loud Armaments is destroyed, enter burst mode. Can summon a Blazing Spiral that lasts for 5s. It will continuously pull enemies and make them take 30% more Total DMG. A Blazing Spiral deals 600% ATK of Fire DMG when created, which increases by 400% ATK for every Loud Armaments destroyed."
          },
          {
            "name": "Transmission",
            "description": "In Special Weapon: No. 9, Interlude Salute and Evasion deal 60% more Total DMG. Casting Interlude Salue restores 5 SP. Every 3 casts of Interlude Salute refreshes weapon active CD, but exiting the combat vehicle resets the counter."
          },
          {
            "name": "Reversal",
            "description": "Weapon active deals 30% more Total DMG. In burst mode, casting weapon active restores 25 Chariot Heat Value, Total DMG increases by 40%, and hitting an enemy inflicts Target Lock on all eneimes once; CD: 5s."
          },
          {
            "name": "Slight",
            "description": "Target Lock becomes an AoE attack and deals 120% ATK more of Fire DMG. If Target Lock hits, Valkyrie deals 30% more Total DMG for 5s. Triggering it again refreshes the duration."
          },
          {
            "name": "Facade",
            "description": "Within 15s of entering Special Weapon: No. 9 or Weapon Mode, Valkyrie deals 50% more Fire DMG, and Target Lock hits 1 more time and recovers 0.3 more SP."
          }
        ]
      }
    ],
    "Goushinsso Memento": [
      {
        "name": "Goushinsso Memento",
        "signets": [
          {
            "name": "Whiteout",
            "description": "Zankeki deals an extra 200% ATK of Ice DMG in a large area. Each stack of Deep Freeze increases Zankeki's Ice DMG by 1%."
          },
          {
            "name": "Florish",
            "description": "Zankeki's rush sequence restores KE to 200 and 1 Ultimate Evasion attempt on hitting an enemy. Triggering Ultimate Evasion Skill restores 1000 KE and 7 SP. When KE falls below 0, Ultimate Evasion Skill is auto-triggered."
          },
          {
            "name": "Icy Sakura",
            "description": "With 20 stacks of Deep Freeze, Ultimate clears all stacks of Deep Freeze to deal 2000% + number of stacks × 50% ATK of Ice DMG, refresh 3 Ultimate Evasion Skill attempts, and make Zankeki deal 20% bonus Total DMG and consume 600 KE for 10s. Triggering it again refreshes the duration."
          },
          {
            "name": "Frozen Cloud",
            "description": "Raises the cap on Deep Freeze to 40 stacks. At the start of battle, gain 20 stacks of Deep Freeze and 75 SP. Whenever Deep Freeze stacks are gained or consumed, Total DMG increases by 0.3% untile capping at 60%. Hitting the cap increases Total DMG by another 20%."
          },
          {
            "name": "Haste",
            "description": "Triggering Ultimate Evasion or Ultimate Evasion Skill deals 500% of ATK of Ice DMG to nearby enemies. This attack counts as Zankeki and deals an extra 100% ATK of Ice DMG for each exclusive signet owned."
          }
        ]
      }
    ],
    "Herrscher of Human: Ego": [
      {
        "name": "Herrscher of Human: Ego",
        "signets": [
          {
            "name": "First Encounter",
            "description": "Charged ATKs in Herrscher of Human Form pull eneimes on both sides of the arrow slightly towards the center. Charged ATK deals an additional 1500% ATK of Ice DMG. If a Charged ATK hits more than 10 times, eneimes take 10% more Total DMG from Charged ATKs for every Nexus Signet owned (cannot stack)."
          },
          {
            "name": "First Bloom",
            "description": "In Herrscher of Origin Form, Ice DMG increases by 100%. In Herrscher of Human Form, using Charge ATKs reduces Ultimate CD by 1s and restores 25 SP."
          },
          {
            "name": "First Awakening",
            "description": "In Herrscher of Origin Form, triggering Ultimate Evasion Skill restores 400 Herrscher Charge. Charged ATKs and special weapon skill deal an addition 2000% ATK of Ice DMG."
          },
          {
            "name": "First Journey",
            "description": "When switching to Herrscher From, increase DMG taken by all enemies by 50% for 5s and gain 4 Pristine Crystals. Charged ATKs in Herrscher of Human Form and Ultimate Evasion Skill in Herrscher of Origin Form will clear all Pristine Crystals to deal 1500% × 4 ATK of Ice DMG."
          },
          {
            "name": "First Yearning",
            "description": "In Herrscher of Human Form, Charged ATK Speed increases by 30% for 5s after triggering Ultimate Evasion Skill. When using Charged ATK, shooting speed continuously increases, to a maximum of 80%. Move Speed while using Charged ATKs increases by 100%. Resets when Charged ATK ends. When Charged ATK hits, Ultimate Evasion CD decreases by 2.5s and weapon skill CD decreases by 1s. Gain 1 stack of Crystal Ice Mirror for every Charged ATK that hits an enemy. Every stack of Crystal Ice Mirror increases Ice DMG from Charged ATKs by 25%."
          }
        ]
      }
    ],
    "Herrscher of the Void": [
      {
        "name": "Herrscher of the Void",
        "signets": [
          {
            "name": "Law",
            "description": "Aerial explosion triggered after Ultimate ends deals 3000% ATK of Physical DMG. Gain Spatial Silence stacks after summoning Space Core. Triggering aerial explosion will clear all Spatial Silence stacks and deal additional number of Spatial Silence stacks × 200% ATK of Physical DMG while restoring number of Spatial Silence stacks × 5 SP."
          },
          {
            "name": "Coleus",
            "description": "Physical DMG dealt by Space Core increases by 80%. Regain 30 Herrscher Charge and gain 30% more Total DMG for 5s upon summoning Space Core. Triggering it again resets the duration. In Herrscher Form, Space Core's area of explosion is expanded and can gather surrounding enemies."
          },
          {
            "name": "Annihilation",
            "description": "In Herrscher Form, the 3rd SEQ of Basic ATK includes one blow of Charged ATK: Time Tremor that deals 300% ATK of Physical DMG."
          },
          {
            "name": "Virtuality",
            "description": "Ultimate Evasion Skill can be triggered even without Ultimate Evasion conditions when there are no enemies along the path of Phase Shuttle. Time-slow area of effect triggered by Ultimate Evasion Skill expands and all enemies in range take 40% more Total DMG for 12s. Triggering it again resets the duration."
          },
          {
            "name": "Innateness",
            "description": "Restores 2 SP and reduces CD of Ultimate Evasion Skill, weapon skill, and Ultimate by 6s each when summoning a Space Core. In Herrscher Form, Basic ATKs directly connect to SEQ 3 for a short duration after triggering Ultimate Evasion."
          }
        ]
      }
    ],
    "Jade Knight": [
      {
        "name": "Jade Knight",
        "signets": [
          {
            "name": "Great Blade",
            "description": "[ATK] will consume an additional 5 Blade Sanction in Sword Array, triggering [Cloud Cutter] 3 times, dealing 240% ATK of Ice DMG to enemies within 3m."
          },
          {
            "name": "Cloudwalker",
            "description": "[Wild Swords] and [Heart Piercer] deal an additional 1000% ATK of Ice DMG. [Heart Piercer] draws in enemies when triggererd. [Heart Piercer] will be unleashed automatically when Blade Sanction reaches 0. When casting [Cloud Cutter] enter [Cloud Cut] mode for 8s. Each hit of [Cloud Cutter] increases [Cloud Cutter] and [Heart Piercer]'s Ice DMG increase by 1.2% (120% Max). Triggering it again resets the duration."
          },
          {
            "name": "Smoky Waft",
            "description": "Blade Sanction built up by Basic ATKs increases by 100%. Restore 10 SP when [Bolt Slash] strikes an enemy. Special Combo [Back Wind Slash] deals an additional 150% ATK of Ice DMG."
          },
          {
            "name": "Shaft",
            "description": "[ULT]during Sword Array triggers [Bolt Slash], dealing an additional 500% ATK of Ice DMG. Back Wind Slash restores an addtional 10 SP."
          },
          {
            "name": "Jade Moon",
            "description": "Ultimate deals additional 3000% ATK of Ice DMG. Back Wind Slash reduces Ultimate CD by 8s. After casting Ultimate, Bolt Slash will not consume Blade Sanction and Ice DMG dealt increases by 50% for 5s. Triggering it again resets the duration."
          }
        ]
      }
    ]
  }
}